In [2]:
import pandas as pd 
import numpy as np

In [182]:
# Things to do
# Map all routes in miami from buses and see how much area it covers
# Compare Miami vs other cities that have already adopted urban sensing
# Tableau map all the bus routes
# Compare the bus # vs the total car population and show %'s'
# What sensors can be useful in miami
# Solve situation, solution and sovergitny for Miami
# 20 century thinking vs 21 century thinking
# http://www.miamidade.gov/transit/WebServices/Transit_XML_Data_Feeds.pdf Information to webscrape information from

In [239]:
trips=pd.read_csv('trips.txt') # Lists all trips by route with destination sign for each
routes=pd.read_csv('routes.txt')# Lists route names
stop_times=pd.read_csv('stop_times.txt')# Contains a list of stops by routes, by trip, with their individual stop times
stops=pd.read_csv('stops.txt')# Lists stops with their individual latitude and longitude
shapes=pd.read_csv('shapes.txt')# Contains information for route traces
calendar=pd.read_csv('calendar.txt') # Dates - Lists dates when MDT routes operate in holiday schedule
# Cleaning Data sets
trips=trips.drop(['trip_short_name','wheelchair_accessible','bikes_allowed'],axis=1)
routes=routes.drop(['agency_id','route_desc','route_url','route_text_color'],axis=1)
stop_times=stop_times.drop(['stop_headsign'],axis=1)
stops=stops.drop(['zone_id','stop_url','location_type','parent_station','stop_timezone','wheelchair_boarding','stop_desc'],axis=1)

In [255]:
trips.head()

,route_id,service_id,trip_id,trip_headsign,direction_id,block_id,shape_id
0,21358,1,4363650,1 - SW 168 St,0,1338419,164141
1,21358,1,4363658,1 - SW 168 St,0,1338418,164141
2,21358,1,4363649,1 - SW 168 St,0,1338419,164141
3,21358,1,4363656,1 - SW 168 St,0,1338418,164141
4,21358,1,4363648,1 - SW 168 St,0,1338419,164141

In [241]:
routes.head()

,route_id,route_short_name,route_long_name,route_type,route_color
0,21358,1,SO.MIAMI HTS-PERRINE VIA SOUTHLAND,3,FF00FF
1,21387,2,DOWNTOWN-163 ST MALL VIA NW 2 AVE,3,008000
2,21416,3,AVENTURA-DOWNTOWN VIA BISC.BLVD.,3,800080
3,21440,7,DOWNTOWN-DOLPH MALL/AIRPORT VIA 7ST,3,FF0000
4,21447,8,BRICKELL-107AV/WSTCHSTR VIA SW 8 ST,3,800000

In [242]:
stop_times.head()

,trip_id,arrival_time,departure_time,stop_id,stop_sequence,pickup_type,drop_off_type,shape_dist_traveled
0,4363640,11:15:00,11:15:00,1,1,0,0,NaN
1,4363640,11:15:29,11:15:29,3614,2,0,0,0.1548
2,4363640,11:16:07,11:16:07,3213,3,0,0,0.3540
3,4363640,11:16:43,11:16:43,3214,4,0,0,0.5445
4,4363640,11:18:16,11:18:16,3621,5,0,0,1.0269

In [272]:
print(stop_times['stop_id'].unique())

[    1  3614  3213 ... 10993 10994 10995]

In [273]:
stops.head()

   stop_id stop_code                   stop_name   stop_lat   stop_lon
0        1  115AQRSN  SW 114 AV & QUAIL ROOST DR  25.592446 -80.377954
1        2  CTLRTERW  SW 211 ST & SOUTHLAND MALL  25.571929 -80.366647
2        3  SHCTPERN            US 1 & SW 174 ST  25.608124 -80.347631
3        4  152SBSWN          BUSWAY & SW 152 ST  25.628291 -80.341621
4        5  136SBSWN          BUSWAY & SW 136 ST  25.644519 -80.334092

In [274]:
print(stops['stop_id'].unique())

[    1     2     3 ... 11238 11239 11240]

In [244]:
shapes.head()

,shape_id,shape_pt_lat,shape_pt_lon,shape_pt_sequence,shape_dist_traveled
0,164141,25.592615,-80.378586,1,0.0000
1,164141,25.591776,-80.379684,2,0.1440
2,164141,25.591535,-80.380010,3,0.1867
3,164141,25.591209,-80.380449,4,0.2435
4,164141,25.590993,-80.380741,5,0.2820

In [235]:
calendar.head()

,service_id,monday,tuesday,wednesday,thursday,friday,saturday,sunday,start_date,end_date
0,1,1,1,1,1,1,0,0,20190630,20191116
1,2,0,0,0,0,0,1,0,20190630,20191116
2,3,0,0,0,0,0,0,1,20190630,20191116
3,6,1,1,1,1,1,0,0,20190324,20191116
4,7,0,0,0,0,0,1,0,20190324,20191116

In [281]:
stop_new= pd.merge(stop_times,stops,on='stop_id')
stop_new.isna().sum()

trip_id                    0
arrival_time               0
departure_time             0
stop_id                    0
stop_sequence              0
pickup_type                0
drop_off_type              0
shape_dist_traveled    23687
stop_code                  0
stop_name                  0
stop_lat                   0
stop_lon                   0
dtype: int64

In [284]:
trip_stop=pd.merge(stop_new,trips,on='trip_id')
trip_stop.head()

,trip_id,arrival_time,departure_time,stop_id,stop_sequence,pickup_type,drop_off_type,shape_dist_traveled,stop_code,stop_name,stop_lat,stop_lon,route_id,service_id,trip_headsign,direction_id,block_id,shape_id
0,4363640,11:15:00,11:15:00,1,1,0,0,NaN,115AQRSN,SW 114 AV & QUAIL ROOST DR,25.592446,-80.377954,21358,1,1 - SW 168 St,0,1338418,164141
1,4363640,11:15:29,11:15:29,3614,2,0,0,0.1548,QRSD17A3,QUAIL ROOST DR & SW 117 AV,25.591811,-80.379838,21358,1,1 - SW 168 St,0,1338418,164141
2,4363640,11:16:07,11:16:07,3213,3,0,0,0.3540,C117QUA4,SW 117 AV & QUAIL ROOST DR,25.590333,-80.380733,21358,1,1 - SW 168 St,0,1338418,164141
3,4363640,11:16:43,11:16:43,3214,4,0,0,0.5445,C1171923,SW 117 AV & SW 192 ST,25.588605,-80.380631,21358,1,1 - SW 168 St,0,1338418,164141
4,4363640,11:18:16,11:18:16,3621,5,0,0,1.0269,C19213B6,SW 192 ST & SW 113 PL,25.588389,-80.376020,21358,1,1 - SW 168 St,0,1338418,164141

In [286]:
trips_stop_routes=pd.merge(trip_stop,routes,on='route_id')

In [ ]:
trips_stop_routes_shapes=pd.merge(trips_stop_routes,shapes,on='shape_id')